# ExternalResourceType Operators

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ExternalResourceType Operators
ExternalResourceType Class See Also
---
The ExternalResourceType type exposes the following members.
# Operators
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Equality | Compares two ExternalResourceType instances. |
| Inequality | Compares two ExternalResourceType instances. |

# See Also
ExternalResourceType Class
Autodesk.Revit.DB Namespace